{"basics":{"name":"Sevi Melvin","label":"Master of Research Student","email":"melvinsevi6@gmail.com","profiles":[{"network":"GitHub","url":"https://github.com/melvinsevi"},{"network":"LinkedIn","url":"https://www.linkedin.com/in/melvin-sevi-ens-mva-6660b0209/"}]},"summary":"Final-year Master of Research student in Mathematics, Vision, Apprentissage (MVA) program at ENS Paris-Saclay, with research interests in Computer Vision, Generative AI, Diffusion Models, and Large Language Models. Seeking opportunities to pursue a Ph.D. and contribute to cutting-edge research in the field.","education":[{"institution":"ENS Paris-Saclay","location":"Paris, France","studyType":"Master of Research (MVA, 2nd year)","startDate":"2023","endDate":"2024","summary":"Mathematics, Vision, Apprentissage (MVA)"},{"institution":"Sorbonne University","location":"Paris, France","studyType":"Master's in Applied Mathematics (1st year)","startDate":"2022","endDate":"2023",},{"institution":"Sorbonne University","location":"Paris, France","studyType":"Bachelor's in Mathematics","startDate":"2019","endDate":"2022","summary":},{"institution":"Sorbonne University","location":"Paris, France","studyType":"Bachelor's in Computer Science","startDate":"2019","endDate":"2022",}],"projects":[{"name":"Text-to-Image generation control with IP-Adapter (Project at the MVA)","startDate":"2023-09-01","endDate":"","summary":"Contributing to enhancing the IP-Adapter model for text-to-image generation to increase expressiveness and variability of generated images while maintaining realism."},{"name":"Refining image segmentation through diffusion models (Project at the MVA)","startDate":"2023-2024","endDate":"","summary":"Exploring the use of diffusion models for refining image segmentation tasks to enhance accuracy and robustness."},{"name":"Data challenge for sketch drawings images classification (Project at the MVA)","startDate":"2023","endDate":"","summary":"Fine-tuning pre-trained ViT transformer for classifying sketch drawing images, achieving high accuracy and generalizability."},{"name":"Graph Neural Networks Benchmarking Paper Review (Project at the MVA)","startDate":"2023","endDate":"","summary":"Provided detailed review and insights into the findings and implications of the paper 'Benchmarking Graph Neural Networks'."},{"name":"Numerical Probabilities and Computational Statistics (Project at Sorbonne University)","startDate":"2023","endDate":"","summary":"Implemented the EM algorithm for parameter estimation in Hidden Markov Models, demonstrating mastery over numerical probability concepts and computational statistics."},{"name":"Graph Motif Detection Project","startDate":"2021","endDate":"","summary":"Developed efficient computational algorithms to detect subgraph structures, known as motifs, in large graphs."}],"researchExperience":"From April to September, I will undertake a 6-month research internship as part of my MVA master's degree, aiming to publish a paper at top conferences. Actively seeking opportunities.","professionalExperience":[{"title":"Tutoring","startDate":"2022","endDate":"2023","summary":"Tutored a small class of 14 second-year bachelor's students in topology, differential calculus, and probability for two consecutive semesters. Developed personalized lesson plans and materials, fostering a collaborative learning environment."}],"skills":[{"category":"Programming Languages and Software","items":["Python (Advanced)","C, Java, C++ (Intermediate)","NumPy, Pytorch, Pandas, Scikit-learn, OpenCV, Google Cloud (Familiar)"]},{"category":"Natural Languages","items":["French (Fluent)","English (Good)","Spanish (Basic)"]}],"achievements":["Graduated with High Honors from the first year Master's program at SU.","Ranked in the top 7% during the first year of the Bachelor's program, qualifying for a dual degree in Mathematics and Computer Science.","Ranked among the top students in various Master's level courses.","Received admission offers from renowned institutions including ENSAE Paris – Institut Polytechnique de Paris and Dauphine PSL."],"interests":["Chess (Avid player with a peak rating of 1600 on chess.com)","Competitive Sports (Varsity Basketball)","Music Enthusiast (Jazz and Hip Hop)"]}